{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentParameters.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "conditionalaccesspolicies": {
          "value": [
              {               
                "displayName": "Require MFA for Cloud-Only Users",
                "state": "enabled",
                "conditions": {
                    "applications": {
                        "includeApplications": [
                            "All"
                        ]
                    },
                    "users": {
                        "includeGroups": [
                            "252a70a9-2152-4a1b-8d45-c0130aaae662"
                        ]
                    }
                },
                "grantControls": {
                    "operator": "OR",
                    "builtInControls": [
                        "mfa"
                    ]
                }
              }               
          ]
        }
    }
}
